### <center>Data Loading, Storage, File Format Using Pandas</center>

#### Reading and Writing Data in Text Format

In [2]:
import pandas as pd
import numpy as np

In [4]:
Dataframe = pd.read_csv('./Dataset/ex1.csv')

In [5]:
Dataframe

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
Dataframe1 = pd.read_table('./Dataset/ex1.csv')

In [9]:
Dataframe1

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [12]:
Dataframe2 = pd.read_csv('./Dataset/ex2.csv',header=None)

In [13]:
Dataframe2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [17]:
Dataframe3 = pd.read_csv('./Dataset/ex2.csv',names=['a','b','c','d','Greeting'])

In [18]:
Dataframe3

   a   b   c   d Greeting
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12      foo

In [21]:
Dataframe4 = pd.read_csv('./Dataset/ex2.csv',names=['a','b','c','d','Greeting'],index_col=['Greeting'])

In [22]:
Dataframe4

          a   b   c   d
Greeting
hello     1   2   3   4
world     5   6   7   8
foo       9  10  11  12

In [23]:
Dataframe5 = pd.read_csv('./Dataset/mindex.csv')

In [24]:
Dataframe5

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [25]:
Dataframe6= pd.read_csv('./Dataset/mindex.csv',index_col=['key1','key2'])

In [26]:
Dataframe6

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [36]:
Dataframe7= pd.read_csv('./Dataset/ex3.txt',sep='\s+')

In [37]:
Dataframe7

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [38]:
Dataframe8 = pd.read_csv('./Dataset/ex4.csv')

In [39]:
Dataframe8

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [41]:
Dataframe8= pd.read_csv('./Dataset/ex4.csv', header=[1])

In [42]:
Dataframe8

,a,b,c,d,message
0,# just wanted to make things more difficult fo...,NaN,NaN,NaN,NaN
1,# who reads CSV files with computers,anyway?,NaN,NaN,NaN
2,1,2,3.0,4.0,hello
3,5,6,7.0,8.0,world
4,9,10,11.0,12.0,foo

In [44]:
Dataframe8 = pd.read_csv('./Dataset/ex4.csv',skiprows=[0,2,3])

In [45]:
Dataframe8

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [46]:
Dataframe9 = pd.read_csv('./Dataset/ex5.csv')
Dataframe9

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [47]:
pd.isnull(Dataframe9)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [48]:
pd.isna(Dataframe9)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [38]:
Dataframe9 = pd.read_csv('./Dataset/ex5.csv',na_values=['two'])

In [39]:
Dataframe9

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [60]:
sentinels={'message':['world','foo']}
Dataframe10 = pd.read_csv('./Dataset/ex5.csv',na_values=sentinels)

In [61]:
Dataframe10

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8      NaN
2     three  9  10  11.0  12      NaN

#### Reading Text File into Pieces

In [3]:
pd.options.display.max_rows

60

In [65]:
pd.options.display.max_rows=10

In [71]:
Dataframe11=pd.read_csv('./Dataset/ex6.csv',nrows=10)

In [72]:
Dataframe11

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [81]:
chunker=pd.read_csv('./Dataset/ex6.csv',chunksize=10)

In [82]:
chunker

In [83]:
type(chunker)

pandas.io.parsers.TextFileReader

In [85]:
tot = pd.Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)
tot=tot.sort_values(ascending=False)

<ipython-input-85-df0be6582931>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [86]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

#### Writing Data to Text Format

In [3]:
data = pd.read_csv('./Dataset/ex5.csv')

In [4]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [89]:
data.to_csv('./Dataset/Output.csv')

In [90]:
import sys
data.to_csv(sys.stdout,sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [92]:
data.to_csv(sys.stdout,na_rep="None",sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|Null
1|two|5|6|Null|8|world
2|three|9|10|11.0|12|foo

In [95]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [99]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'],na_rep="Null")

a,b,c
1,2,3.0
5,6,Null
9,10,11.0

In [5]:
dates = pd.date_range('1/1/2000',periods=7)

In [101]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [8]:
ts=pd.Series(np.arange(7), index=dates)

In [9]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [33]:
import csv
f=open("./Dataset/ex7.csv")
r=csv.reader(f)

In [6]:
type(f)

_io.TextIOWrapper

In [9]:
type(r)

_csv.reader

In [4]:
for line1 in r:
    print(line1)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [23]:
with open('./Dataset/ex7.csv') as f:
    lines=list(csv.reader(f))

In [24]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [25]:
header,values=lines[0],lines[1]

In [26]:
header

['a', 'b', 'c']

In [27]:
values

['1', '2', '3']

In [28]:
data_dict={h:v for h,v in zip(header,zip(*values))}

In [29]:
data_dict

{'a': ('1', '2', '3')}

In [34]:
class mydialect(csv.Dialect):
    lineterminator='\n'
    delimiter=';'
    quotechar='"'
    quoting=csv.QUOTE_MINIMAL

In [35]:
reader=csv.reader(f,dialect=mydialect)

In [37]:
reader

In [36]:
reader=csv.reader(f,delimiter='|')

In [38]:
with open('./Dataset/mydata.csv','w') as f:
    writer=csv.writer(f,dialect=mydialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('11','12','13'))
    writer.writerow(('21','22','23'))

#### Reading & Writing Json Data

In [40]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [41]:
obj

'\n{"name": "Wes",\n"places_lived": ["United States", "Spain", "Germany"],\n"pet": null,\n"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},\n{"name": "Katie", "age": 38,\n"pets": ["Sixes", "Stache", "Cisco"]}]\n}\n'

In [42]:
import json
result=json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [43]:
json.dumps(result)

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [44]:
import pandas as pd

In [45]:
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])

In [46]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [48]:
data=pd.read_json('./Dataset/Sample.json')

In [49]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

#### XML & HTML Web Scraping

In [7]:
import pandas as pd
tables=pd.read_html('https://en.wikipedia.org/wiki/London')

In [8]:
len(tables)

33

In [9]:
failures=tables[0]

In [10]:
failures.head()

,London,London.1
0,Capital city,Capital city
1,Clockwise from top: City of London in the fore...,Clockwise from top: City of London in the fore...
2,.mw-parser-output .locmap .od{position:absolut...,.mw-parser-output .locmap .od{position:absolut...
3,"Coordinates: .mw-parser-output .geo-default,.m...","Coordinates: .mw-parser-output .geo-default,.m..."
4,Sovereign state,United Kingdom

#### Parsing XML with lxml.objectify

In [13]:
from lxml import objectify

In [15]:
path='./Dataset/Sample.xml'
parsed=objectify.parse(open(path))
root=parsed.getroot()

In [16]:
parsed

In [17]:
root

In [19]:
data=[]
skip_fields=['PARENT_SEQ', 'INDICATOR_SEQ',
'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [20]:
for elt in root:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [12]:
print(data)

[{'AGENCY_NAME': 'Metro-North Railroad', 'INDICATOR_NAME': 'Escalator Availability', 'DESCRIPTION': 'Percent of the time that escalators are operational\nsystemwide. The availability rate is based on physical observations performed\nthe morning of regular business days only. This is a new indicator the agency\nbegan reporting in 2009.', 'PERIOD_YEAR': 2011, 'PERIOD_MONTH': 12, 'CATEGORY': 'Service Indicators', 'FREQUENCY': 'M', 'INDICATOR_UNIT': '%', 'YTD_TARGET': 97.0, 'YTD_ACTUAL': '', 'MONTHLY_TARGET': 97.0, 'MONTHLY_ACTUAL': ''}]

In [21]:
perf=pd.DataFrame(data)

In [22]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,12,Service Indicators,M,%,97.0,,97.0,

In [23]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [24]:
root
root.get('href')
root.text

'Google'

#### Binary Data Format

One of the easiest ways to store data (also known as serialization) efficiently in binary
format is using Python’s built-in pickle serialization. pandas objects all have a
to_pickle method that writes the data to disk in pickle format:

In [26]:
frame = pd.read_csv('./Dataset/ex1.csv')

In [27]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
frame.to_pickle('./Dataset/frame_pickle')

In [29]:
pd.read_pickle('./Dataset/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

#### Using HDF5 Format

HDF5 is a well-regarded file format intended for storing large quantities of scientific
array data. It is available as a C library, and it has interfaces available in many other
languages, including Java, Julia, MATLAB, and Python. The “HDF” in HDF5 stands
for hierarchical data format.

In [40]:
import numpy as np
frame =pd.DataFrame({'a': np.random.randn(100)})

In [41]:
store=pd.HDFStore('mydata.h5')

In [42]:
store['obj1']=frame

In [43]:
store['obj1_col']=frame['a']

In [44]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [45]:
store['obj1']

           a
0   0.319936
1   2.186128
2  -0.346786
3   0.023981
4  -0.268316
..       ...
95 -0.415301
96  0.408262
97 -0.100193
98 -2.000550
99 -0.730783

[100 rows x 1 columns]

HDFStore supports two storage schemas, 'fixed' and 'table'. The latter is generally
slower, but it supports query operations using a special syntax

In [46]:
store.put('obj2', frame, format='table')

In [47]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  1.816662
11  0.442663
12  0.069031
13 -0.147314
14 -0.660880
15  0.958315

In [48]:
store.close()

In [49]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [50]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.319936
1  2.186128
2 -0.346786
3  0.023981
4 -0.268316

#### Reading Microsoft Excel Files

In [54]:
import pandas as pd
xlsx = pd.ExcelFile('./Dataset/ex1.xlsx')

In [55]:
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [56]:
frame=pd.read_excel('./Dataset/ex1.xlsx','Sheet1')

In [57]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

To write pandas data to Excel format, you must first create an ExcelWriter, then
write data to it using pandas objects’ to_excel method:

In [58]:
writer=pd.ExcelWriter('./Dataset/ex2.xlsx')

In [60]:
frame.to_excel(writer,'Sheet1')

writer.save

You can also pass a file path to to_excel and avoid the ExcelWriter:

In [62]:
frame.to_excel('./Dataset/ex2.xlsx')

#### Interacting with Web APIs

In [63]:
import requests

In [65]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [66]:
resp = requests.get(url)

In [67]:
resp

The Response object’s json method will return a dictionary containing JSON parsed
into native Python objects:

In [68]:
data = resp.json()

In [69]:
data[0]['title']

'RLS: 1.3.4'

In [70]:
issues=pd.DataFrame(data,columns=['number','title','labels','state'])

In [71]:
issues

,number,title,labels,state
0,43531,RLS: 1.3.4,"[{'id': 131473665, 'node_id': 'MDU6TGFiZWwxMzE...",open
1,43530,DOC: Start v1.3.4 release notes,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
2,43529,DOC: fix doc to understand fillna with second ...,[],open
3,43528,BUG: read_csv() incorrectly parses data in cas...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,43527,BUG/PERF: sparse min/max don't densify,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
5,43526,TST: pytest.mark.single for test_unique_bad_un...,[],open
6,43524,PERF: avoid rebuilding blknos,[],open
7,43523,DEPR: index argument to SparseArray,"[{'id': 49182326, 'node_id': 'MDU6TGFiZWw0OTE4...",open
8,43522,DOC: Typo in `fillna()` documentation,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
9,43519,REF: share GroupBy.count,[],open
10,43518,PERF: groupby.pad/backfill follow-up,[],open
11,43517,split macos tests in 2,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
12,43516,"BUG: Error ""no attribute 'total_seconds'"" with...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,43515,"BUG: Groupby.agg with timegrouper, nat, and numba",[],open
14,43514,TYP: sparse.pyi,"[{'id': 49182326, 'node_id': 'MDU6TGFiZWw0OTE4...",open
15,43513,TYP: SparseArray,"[{'id': 49182326, 'node_id': 'MDU6TGFiZWw0OTE4...",open
16,43511,Updated code_checks.sh,[],open
17,43510,CLN/PERF: group quantile,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
18,43507,BUG/API: concat with empty DataFrames or all-N...,[],open
19,43504,ENH: consistency of input args for boundaries ...,[],open
20,43503,BUG: dtype changes when row passed to a functi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,43501,REGR: FutureWarning issued and empty DataFrame...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
22,43498,ENH: Add observed keyword to value_counts,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
23,43495,ENH Remove import time warning for missing lzma,"[{'id': 527603109, 'node_id': 'MDU6TGFiZWw1Mjc...",open
24,43486,BUG: groupby(Grouper) with all-NaT grouping keys,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,43485,API: pd.concat with len(keys) != len(values) d...,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
26,43483,ENH: set sticky levels accept level names,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
27,43480,BUG: DataFrameGroupBy.boxplot with subplots=Fa...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,43472,Add `inplace` input param to `add_prefix` and ...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,43471,ENH: expand multicol_align and multirow_align ...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open

####  Interacting with Databases

In [72]:
import sqlite3

In [73]:
query="""CREATE TABLE test(a VARCHAR(20),b VARCHAR(20),c REAL, d INTERGER);"""

In [74]:
con=sqlite3.connect('mydata.sqlite')

In [75]:
con.execute(query)

In [76]:
con.commit()

In [77]:
data = [('Atlanta', 'Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3),('Sacramento', 'California', 1.7, 5)]

In [78]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [79]:
con.executemany(stmt,data)

In [80]:
con.commit()

In [81]:
cursor=con.execute('select * from test')

In [83]:
rows=cursor.fetchall()

In [84]:
print(rows)

[('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]